# Задача 1: Приветствие
# Напишите программу, которая запрашивает у пользователя его имя и выводит приветствие.
# Пример:
# Ввод: Кирилл
# Вывод: Привет, Кирилл!
a = input()
b = 'Привет,'
c = '!'
print(b, a, c)
